{
    "posts": [
        {
            "id": "1",
            "title": "আবরার ফাহাদ: একজন সাহসী ছাত্রের গল্প",
            "slug": "abrar-fahad-story",
            "image": "/abrar-fahad.png",
            "excerpt": "আবরার ফাহাদ ছিলেন বুয়েটের একজন মেধাবী ছাত্র যিনি সত্যের পক্ষে দাঁড়িয়ে জীবন দিয়েছেন।",
            "body": "আবরার ফাহাদ ছিলেন বাংলাদেশ প্রকৌশল বিশ্ববিদ্যালয়ের (বুয়েট) একজন মেধাবী ছাত্র। তিনি ছিলেন একজন সৎ এবং সাহসী যুবক যিনি সবসময় সত্যের পক্ষে কথা বলতেন।\n\nতার অকাল মৃত্যু আমাদের জাতির জন্য একটি বড় ক্ষতি। তিনি আমাদের শিখিয়ে গেছেন যে সত্যের জন্য লড়াই করতে হয় এবং অন্যায়ের বিরুদ্ধে সোচ্চার হতে হয়।\n\nআবরার ফাহাদের স্মৃতি আমাদের হৃদয়ে চিরকাল বেঁচে থাকবে। তার আদর্শ আমাদের পথ দেখাবে।",
            "date": "2025-12-15",
            "author": "Osman Hadi Archive Team"
        },
        {
            "id": "2",
            "title": "আবু সাঈদ: সাহসিকতার প্রতীক",
            "slug": "abu-sayed-courage",
            "image": "/abu-sayed.png",
            "excerpt": "আবু সাঈদ ছিলেন একজন নিঃস্বার্থ যুবক যিনি দেশের জন্য সর্বোচ্চ ত্যাগ স্বীকার করেছেন।",
            "body": "আবু সাঈদ ছিলেন একজন সাধারণ যুবক যিনি অসাধারণ সাহসিকতার পরিচয় দিয়েছেন। তিনি বিশ্বাস করতেন যে দেশের জন্য কাজ করা প্রতিটি নাগরিকের দায়িত্ব।\n\nতার জীবন ছিল সেবা এবং ত্যাগের এক উজ্জ্বল উদাহরণ। তিনি আমাদের শিখিয়ে গেছেন যে দেশপ্রেম শুধু কথায় নয়, কাজেও প্রকাশ করতে হয়।\n\nআবু সাঈদের আত্মত্যাগ আমাদের অনুপ্রাণিত করে এবং তার স্মৃতি আমাদের শক্তি দেয়।",
            "date": "2025-12-10",
            "author": "Osman Hadi Archive Team"
        },
        {
            "id": "3",
            "title": "উসমান হাদি: একজন সত্যিকারের দেশপ্রেমিক",
            "slug": "osman-hadi-patriot",
            "image": "/osman-hadi.png",
            "excerpt": "উসমান হাদি ছিলেন একজন সৎ এবং নিষ্ঠাবান যুবক যিনি বাংলাদেশের জন্য জীবন উৎসর্গ করেছেন।",
            "body": "উসমান হাদি ছিলেন একজন সত্যিকারের দেশপ্রেমিক। তিনি বিশ্বাস করতেন যে একটি সুন্দর বাংলাদেশ গড়তে হলে প্রত্যেককে নিজের দায়িত্ব পালন করতে হবে।\n\nতার জীবন ছিল সততা এবং নিষ্ঠার এক অনন্য উদাহরণ। তিনি কখনো অন্যায়ের সাথে আপস করেননি এবং সবসময় সত্যের পক্ষে দাঁড়িয়েছেন।\n\nউসমান হাদির নামে এই আর্কাইভ তৈরি করা হয়েছে তার স্মৃতি এবং আদর্শকে জীবন্ত রাখতে। তার মতো বীরদের গল্প আমাদের নতুন প্রজন্মকে অনুপ্রাণিত করবে।",
            "date": "2025-12-05",
            "author": "Osman Hadi Archive Team"
        },
        {
            "id": "4",
            "title": "মুক্তির গান: স্বাধীনতার চেতনা",
            "slug": "mukti-gaan-freedom",
            "image": "/whonext.png",
            "excerpt": "স্বাধীনতার চেতনা আমাদের জাতির সবচেয়ে বড় শক্তি এবং অনুপ্রেরণার উৎস।",
            "body": "স্বাধীনতার চেতনা আমাদের জাতির সবচেয়ে বড় শক্তি। আমাদের পূর্বপুরুষরা একটি স্বাধীন দেশের জন্য জীবন দিয়েছেন। তাদের এই ত্যাগ আমাদের মনে করিয়ে দেয় যে স্বাধীনতা রক্ষা করা আমাদের দায়িত্ব।\n\nআমরা যদি আমাদের বীরদের গল্প শুনতে পাই, তবে আমরা আরও দেশপ্রেমিক হয়ে উঠব। এই আর্কাইভ সেই চেতনারই প্রতিফলন।",
            "date": "2025-12-20",
            "author": "Osman Hadi Archive Team"
        },
        {
            "id": "5",
            "title": "শহীদদের স্মৃতি: অম্লান থাকুক",
            "slug": "martyrs-memory",
            "image": "/abrar-fahad.png",
            "excerpt": "শহীদদের স্মৃতি আমাদের হৃদয়ে চিরকাল অম্লান হয়ে থাকবে।",
            "body": "আমাদের দেশের ইতিহাসে অনেক বীর তাদের জীবন উৎসর্গ করেছেন। তাদের স্মৃতি ধরে রাখা আমাদের কর্তব্য। আমরা এই আর্কাইভের মাধ্যমে তাদের কথা সবার কাছে পৌঁছে দিতে চাই।",
            "date": "2025-12-19",
            "author": "Osman Hadi Archive Team"
        },
        {
            "id": "6",
            "title": "বাংলাদেশ: আমাদের গর্ব",
            "slug": "bangladesh-our-pride",
            "image": "/GreatBengal.svg",
            "excerpt": "আমাদের প্রিয় জন্মভূমি বাংলাদেশ আমাদের অহংকার এবং গৌরব।",
            "body": "বাংলাদেশ এক অপূর্ব সৌন্দর্যের দেশ। এর ইতিহাস অত্যন্ত সমৃদ্ধ এবং গৌরবময়। আমরা এই মাটির সন্তান হিসেবে গর্বিত।",
            "date": "2025-12-18",
            "author": "Osman Hadi Archive Team"
        },
        {
            "id": "7",
            "title": "ইতিহাসের পাতা থেকে",
            "slug": "from-the-pages-of-history",
            "image": "/osman-hadi.png",
            "excerpt": "বাংলাদেশের ইতিহাসের অজানা কিছু অধ্যায় নিয়ে এই ব্লগ।",
            "body": "ইতিহাস আমাদের অনেক কিছু শেখায়। অতীতের ভুল থেকে শিক্ষা নিয়ে আমরা ভবিষ্যতের জন্য প্রস্তুতি নিতে পারি।",
            "date": "2025-12-17",
            "author": "Osman Hadi Archive Team"
        },
        {
            "id": "8",
            "title": "যুব সমাজের ভূমিকা",
            "slug": "role-of-youth",
            "image": "/abu-sayed.png",
            "excerpt": "একটি দেশ গড়তে যুব সমাজের ভূমিকা অপরিসীম।",
            "body": "যুব সমাজই হলো একটি জাতির মেরুদণ্ড। তাদের শক্তি এবং মেধা দিয়ে তারা যেকোনো অসম্ভবকে সম্ভব করতে পারে।",
            "date": "2025-12-16",
            "author": "Osman Hadi Archive Team"
        },
        {
            "id": "9",
            "title": "সামাজিক সচেতনতা",
            "slug": "social-awareness",
            "image": "/whonext.png",
            "excerpt": "সমাজে সচেতনতা বৃদ্ধিই সুস্থ দেশ গড়ার অন্যতম পূর্বশর্ত।",
            "body": "সামাজিক সমস্যার সমাধানে আমাদের সবাইকে সচেতন হতে হবে। ছোট ছোট পদক্ষেপই হয়তো বড় পরিবর্তনের সূচনা করবে।",
            "date": "2025-12-14",
            "author": "Osman Hadi Archive Team"
        },
        {
            "id": "10",
            "title": "শিক্ষার আলো",
            "slug": "light-of-education",
            "image": "/abrar-fahad.png",
            "excerpt": "শিক্ষা হলো জাতির মেরুদণ্ড এবং উন্নতির চাবিকাঠি।",
            "body": "সুশিক্ষিত জাতিই পারে বিশ্ব দরবারে মাথা উঁচু করে দাঁড়াতে। জ্ঞান অর্জনের মাধ্যমেই আমরা সত্যিকারের মুক্তি পেতে পারি।",
            "date": "2025-12-13",
            "author": "Osman Hadi Archive Team"
        },
        {
            "id": "11",
            "title": "বীরগাথা: অকুতোভয় যোদ্ধা",
            "slug": "brave-fighters",
            "image": "/abu-sayed.png",
            "excerpt": "বাংলার বীর যোদ্ধাদের সাহস ও বীরত্বের গল্প।",
            "body": "আমাদের দেশের বীররা বারবার প্রমাণ করেছেন যে তারা দেশের জন্য প্রাণ দিতে পিছপা হন না। তাদের সেই অসীম সাহস আমাদের অনুপ্রেরণা।",
            "date": "2025-12-12",
            "author": "Osman Hadi Archive Team"
        },
        {
            "id": "12",
            "title": "নতুনের ডাক",
            "slug": "call-for-new",
            "image": "/osman-hadi.png",
            "excerpt": "নতুন দিনের আশায় আমাদের এগিয়ে চলাই হোক আমাদের সংকল্প।",
            "body": "অন্ধকার পেরিয়ে নতুন সূর্যালোক আসবেই। আমাদের কাজ হলো সেই নতুনের জন্য পথ তৈরি করা।",
            "date": "2025-12-11",
            "author": "Osman Hadi Archive Team"
        },
        {
            "id": "13",
            "title": "ঐতিহ্যের খোঁজে",
            "slug": "searching-for-heritage",
            "image": "/GreatBengal.svg",
            "excerpt": "বাংলার সমৃদ্ধ ঐতিহ্য এবং সংস্কৃতির গভীরে এক যাত্রা।",
            "body": "আমাদের সংস্কৃতি এবং ঐতিহ্য আমাদের পরিচয়। একে রক্ষা করা এবং ছড়িয়ে দেওয়া আমাদের দায়িত্ব।",
            "date": "2025-12-09",
            "author": "Osman Hadi Archive Team"
        },
        {
            "id": "14",
            "title": "মানবিকতার জয়",
            "slug": "victory-of-humanity",
            "image": "/whonext.png",
            "excerpt": "বিপদগ্রস্ত মানুষের পাশে দাঁড়ানোই হলো সবচেয়ে বড় ধর্ম।",
            "body": "মানুষ মানুষের জন্য। বিপদের সময় একে অপরের পাশে দাঁড়ালে সমাজ সুন্দর হয়ে ওঠে।",
            "date": "2025-12-08",
            "author": "Osman Hadi Archive Team"
        },
        {
            "id": "15",
            "title": "ভবিষ্যতের বাংলাদেশ",
            "slug": "future-bangladesh",
            "image": "/abu-sayed.png",
            "excerpt": "আমরা কেমন বাংলাদেশ দেখতে চাই তা নিয়ে কিছু ভাবনা।",
            "body": "একটি সমৃদ্ধ, দুর্নীতিমুক্ত এবং মানবিক বাংলাদেশ গড়াই আমাদের লক্ষ্য। নতুন প্রজন্মের হাত ধরে আমরা সেই লক্ষ্যে পৌঁছাব।",
            "date": "2025-12-07",
            "author": "Osman Hadi Archive Team"
        },
        {
            "id": "16",
            "title": "অবিস্মরণীয় দিনগুলি",
            "slug": "unforgettable-days",
            "image": "/abrar-fahad.png",
            "excerpt": "আমাদের আন্দোলনের ইতিহাসের কিছু গুরুত্বপূর্ণ মুহূর্ত।",
            "body": "আন্দোলনের দিনগুলোতে সাধারণ মানুষের স্বতঃস্ফূর্ত অংশগ্রহণ ছিল চোখে পড়ার মতো। সেই দিনগুলোর স্মৃতি আমাদের শক্তি জোগায়।",
            "date": "2025-12-06",
            "author": "Osman Hadi Archive Team"
        }
    ],
    "metadata": {
        "lastUpdated": "2025-12-20",
        "totalPosts": 16
    }
}